app/controllers/mybooks_controller.rb

  def index
    @mybooks = Mybook.all
---
SELECT "mybooks".* FROM "mybooks"

  def create
    @mybook = Mybook.new(mybook_params)

    respond_to do |format|
      if @mybook.save
---
INSERT INTO "mybooks" ("book_name", "author", "price", "publisher", "release", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @mybook.update(mybook_params)
---
UPDATE "mybooks" SET "book_img" = ?, "updated_at" = ? WHERE "mybooks"."id" = ?  [["book_img", "http://ecx.images-amazon.com/images/I/51%2BvqKx4d7L._SX330_BO1,204,203,200_.jpg"], ["updated_at", "2016-02-13 10:52:10.500102"], ["id", 3]]

    def set_mybook
      @mybook = Mybook.find(params[:id])
---
SELECT  "mybooks".* FROM "mybooks" WHERE "mybooks"."id" = ? LIMIT 1  [["id", 3]]